In [1]:
##1. Import Pandas Library

In [2]:
import pandas as pd

##1. Programming: The project must be explored programmatically: this means that you must implement suitable Python tools (code and/or libraries) to complete the analysis required. All of this is to be implemented in a Jupyter Notebook.

In [3]:
##2. Data Collection : Importing Ave Earings per Quarter in Ireland Construction Industry dataset with read csv.

In [4]:
df = pd.read_csv("Earnings and Hours Worked in the Building and Construction Industry.csv", skiprows=[1])

In [5]:
##3. Data Clearning

In [6]:
##3.1 Summary of the data
df.head()

,Unnamed: 0,All manual employee grades,Skilled operatives,Apprentices,Unskilled and semi-skilled - adults,Unskilled and semi-skilled - juveniles,Clerical employees - female,Clerical employees - male,Foremen and supervisors,All employees (clerical and operatives)
0,1969Q1,NaN,"5,024",NaN,"7,009",NaN,NaN,NaN,NaN,NaN
1,1969Q2,NaN,"5,338",NaN,"7,659",NaN,NaN,NaN,NaN,NaN
2,1969Q3,"14,893","4,753","1,279","7,545",326.0,443,564.0,990,"15,900"
3,1969Q4,NaN,"3,964",NaN,"5,906",NaN,NaN,NaN,NaN,NaN
4,1970Q1,NaN,"6,029",NaN,"8,371",NaN,NaN,NaN,NaN,NaN

In [7]:
df.shape # verify number of rows and columns in dataframe

(160, 10)

In [8]:
df.memory_usage() ## We need to save some memory usage.

Index                                       128
Unnamed: 0                                 1280
All manual employee grades                 1280
Skilled operatives                         1280
Apprentices                                1280
Unskilled and semi-skilled - adults        1280
Unskilled and semi-skilled - juveniles     1280
Clerical employees - female                1280
Clerical employees - male                  1280
Foremen and supervisors                    1280
All employees (clerical and operatives)    1280
dtype: int64

In [9]:
df.columns.values ## to verify the column names

array(['Unnamed: 0', 'All manual employee grades', 'Skilled operatives',
       'Apprentices', 'Unskilled and semi-skilled - adults',
       'Unskilled and semi-skilled - juveniles',
       'Clerical employees - female', 'Clerical employees - male',
       'Foremen and supervisors',
       'All employees (clerical and operatives)'], dtype=object)

In [10]:
df.dtypes ## verify the data type of each column

Unnamed: 0                                  object
All manual employee grades                  object
Skilled operatives                          object
Apprentices                                 object
Unskilled and semi-skilled - adults         object
Unskilled and semi-skilled - juveniles     float64
Clerical employees - female                 object
Clerical employees - male                  float64
Foremen and supervisors                     object
All employees (clerical and operatives)     object
dtype: object

## 4. Programming: Testing & Optimisation: You are required to document and evaluate a testing and optimisation strategy for your analysis. As part of this, you may want to plan and document how you ensured your code is doing what it is meant to, as well as ensuring that the code is making good use of your resources (eg computing, time etc). Note any trade-offs that you've made in these areas.

In [11]:
##3.2 renaming columns

In [12]:
column_mapping = {
    'Unnamed: 0': 'Year_Quarter', 'All manual employee grades':'Manual_employee_grades',
    'Skilled operatives':'Skilled_operatives','Unskilled and semi-skilled - adults':'Semi_skilled_adults',
    'Unskilled and semi-skilled - juveniles':'Semi_skilled_juveniles',
    'Clerical employees - female':'Clerical_employees_female',
    'Clerical employees - male':'Clerical_employees_male',
    'Foremen and supervisors':'Foremen_and_supervisors',
    'All employees (clerical and operatives)':'Clerical_and_Operatives'
}
df = df.rename(columns=column_mapping)

In [13]:
df.head() ## Verify the after renaming columns

,Year_Quarter,Manual_employee_grades,Skilled_operatives,Apprentices,Semi_skilled_adults,Semi_skilled_juveniles,Clerical_employees_female,Clerical_employees_male,Foremen_and_supervisors,Clerical_and_Operatives
0,1969Q1,NaN,"5,024",NaN,"7,009",NaN,NaN,NaN,NaN,NaN
1,1969Q2,NaN,"5,338",NaN,"7,659",NaN,NaN,NaN,NaN,NaN
2,1969Q3,"14,893","4,753","1,279","7,545",326.0,443,564.0,990,"15,900"
3,1969Q4,NaN,"3,964",NaN,"5,906",NaN,NaN,NaN,NaN,NaN
4,1970Q1,NaN,"6,029",NaN,"8,371",NaN,NaN,NaN,NaN,NaN

In [14]:
## 3.3 Slipt Year_Quarter in to Year and Quarter

In [15]:
df['Year and Quarter'] =df['Year_Quarter'].str.replace(r'(\w{4})',r'\1-',regex=True).str.strip('\-') # Add new 'Year and Quarter' column by replacing the pattern
df[['Year','Quarter']] = df['Year and Quarter'].str.split('-',expand=True) # Split 'Year and Quarter' column into separate 'Year' and 'Quarter' columns
df = df.drop(['Year_Quarter','Year and Quarter'], axis=1) # Drop unnecessary columns

In [16]:
## 3.4 Reorder columns

In [17]:
df=df[["Year","Quarter","Manual_employee_grades","Skilled_operatives","Apprentices","Semi_skilled_adults","Semi_skilled_juveniles","Clerical_employees_female",
       "Clerical_employees_male","Foremen_and_supervisors","Clerical_and_Operatives"]]

In [18]:
df.tail()  ## Verify the after reordering columns

,Year,Quarter,Manual_employee_grades,Skilled_operatives,Apprentices,Semi_skilled_adults,Semi_skilled_juveniles,Clerical_employees_female,Clerical_employees_male,Foremen_and_supervisors,Clerical_and_Operatives
155,2007,Q4,"13,134","4,316","1,397","5,469",70.0,"1,119",541.0,"1,882","14,794"
156,2008,Q1,"11,951","3,934","1,097","5,260",52.0,"1,126",546.0,"1,608","13,623"
157,2008,Q2,"12,320","4,117","1,247","5,236",102.0,"1,148",519.0,"1,618","13,987"
158,2008,Q3,"11,154","3,730","1,302","4,526",56.0,"1,029",445.0,"1,540","12,628"
159,2008,Q4,"8,811","2,951",838,"3,572",32.0,951,398.0,"1,418","10,160"

In [19]:
## 3.5 find any missing values

In [20]:
df.isnull().sum()

Year                          0
Quarter                       0
Manual_employee_grades       39
Skilled_operatives            0
Apprentices                  39
Semi_skilled_adults           0
Semi_skilled_juveniles       39
Clerical_employees_female    39
Clerical_employees_male      39
Foremen_and_supervisors      39
Clerical_and_Operatives      39
dtype: int64

In [21]:
## 3.6 impute the missing values with forwardfill and backwordfill

In [22]:
df = df.fillna(method='ffill') ## filling the missing values with forward fill method as less number of labels are missing

In [23]:
df = df.fillna(method='backfill')  ## after forward fill only 2 labels missing, so I am using back fill meth

In [24]:
df.isnull().sum() ## Testing again missing values after impute

Year                         0
Quarter                      0
Manual_employee_grades       0
Skilled_operatives           0
Apprentices                  0
Semi_skilled_adults          0
Semi_skilled_juveniles       0
Clerical_employees_female    0
Clerical_employees_male      0
Foremen_and_supervisors      0
Clerical_and_Operatives      0
dtype: int64

In [25]:
## 3.7 Data preparation- ## to do forther analysis we need to convert data type to int for all the variables

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 160 entries, 0 to 159
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Year                       160 non-null    object
 1   Quarter                    160 non-null    object
 2   Manual_employee_grades     160 non-null    object
 3   Skilled_operatives         160 non-null    object
 4   Apprentices                160 non-null    object
 5   Semi_skilled_adults        160 non-null    object
 6   Semi_skilled_juveniles     160 non-null    float64
 7   Clerical_employees_female  160 non-null    object
 8   Clerical_employees_male    160 non-null    float64
 9   Foremen_and_supervisors    160 non-null    object
 10  Clerical_and_Operatives    160 non-null    object
dtypes: float64(2), object(9)
memory usage: 13.9+ KB

In [27]:
## replace ',' with '' in columns values

In [28]:
## remove ',' from each column
df['Manual_employee_grades']=df['Manual_employee_grades'].str.replace(',','') 
df['Skilled_operatives']=df['Skilled_operatives'].str.replace(',','')
df['Apprentices']=df['Apprentices'].str.replace(',','')
df['Semi_skilled_adults']=df['Semi_skilled_adults'].str.replace(',','')
df['Clerical_and_Operatives']=df['Clerical_and_Operatives'].str.replace(',','')
df['Clerical_employees_female']=df['Clerical_employees_female'].str.replace(',','')
df['Foremen_and_supervisors']=df['Foremen_and_supervisors'].str.replace(',','')

In [29]:
## 3.7 converting object and float Dtypes to int.

In [30]:
df= df.astype({'Year':'int', 'Quarter':'category','Manual_employee_grades':'int','Skilled_operatives':'int','Apprentices':'int','Semi_skilled_juveniles':'int',
              'Semi_skilled_adults':'int','Clerical_employees_female':'int','Clerical_employees_male':'int','Clerical_and_Operatives':'int'})

In [31]:
df.info() ## Verifying after converting data types to int

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 160 entries, 0 to 159
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Year                       160 non-null    int32
 1   Quarter                    160 non-null    category
 2   Manual_employee_grades     160 non-null    int32
 3   Skilled_operatives         160 non-null    int32
 4   Apprentices                160 non-null    int32
 5   Semi_skilled_adults        160 non-null    int32
 6   Semi_skilled_juveniles     160 non-null    int32
 7   Clerical_employees_female  160 non-null    int32
 8   Clerical_employees_male    160 non-null    int32
 9   Foremen_and_supervisors    160 non-null    object
 10  Clerical_and_Operatives    160 non-null    int32
dtypes: category(1), int32(9), object(1)
memory usage: 7.4+ KB

In [32]:
df["Foremen_and_supervisors"]=df["Foremen_and_supervisors"].astype('float64') ## convert Dtype object to float

In [33]:
df["Foremen_and_supervisors"]=df["Foremen_and_supervisors"].astype('int') ## convert Dtype again from float to int

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 160 entries, 0 to 159
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Year                       160 non-null    int32
 1   Quarter                    160 non-null    category
 2   Manual_employee_grades     160 non-null    int32
 3   Skilled_operatives         160 non-null    int32
 4   Apprentices                160 non-null    int32
 5   Semi_skilled_adults        160 non-null    int32
 6   Semi_skilled_juveniles     160 non-null    int32
 7   Clerical_employees_female  160 non-null    int32
 8   Clerical_employees_male    160 non-null    int32
 9   Foremen_and_supervisors    160 non-null    int32
 10  Clerical_and_Operatives    160 non-null    int32
dtypes: category(1), int32(10)
memory usage: 6.7 KB

In [35]:
## Testing again before moving to ML part
df.isnull().sum()

Year                         0
Quarter                      0
Manual_employee_grades       0
Skilled_operatives           0
Apprentices                  0
Semi_skilled_adults          0
Semi_skilled_juveniles       0
Clerical_employees_female    0
Clerical_employees_male      0
Foremen_and_supervisors      0
Clerical_and_Operatives      0
dtype: int64

In [36]:
df.duplicated().sum()

0

In [37]:
df.memory_usage() ## We have saved on memory usage. dataset is small but we can apply the efficiencies to a large dataset

Index                        128
Year                         640
Quarter                      364
Manual_employee_grades       640
Skilled_operatives           640
Apprentices                  640
Semi_skilled_adults          640
Semi_skilled_juveniles       640
Clerical_employees_female    640
Clerical_employees_male      640
Foremen_and_supervisors      640
Clerical_and_Operatives      640
dtype: int64

In [38]:
#ireland_ml = df.to_csv('ireland_ml.csv', index=False)

## 2. Data structures: You are required to gather and process data that has been stored in at least two distinct formats. For example, this can be data in a CSV file, from a MySQL database or from a web API in JSON format

In [39]:
##4 Dataframe export

In [40]:
#1. convert all rows into a list of tuples

In [41]:
y = []

for i in range(len(df)):
    row_tuple = tuple(df.iloc[i])
    y.append(row_tuple)
y

[(1969, 'Q1', 14893, 5024, 1279, 7009, 326, 443, 564, 990, 15900),
 (1969, 'Q2', 14893, 5338, 1279, 7659, 326, 443, 564, 990, 15900),
 (1969, 'Q3', 14893, 4753, 1279, 7545, 326, 443, 564, 990, 15900),
 (1969, 'Q4', 14893, 3964, 1279, 5906, 326, 443, 564, 990, 15900),
 (1970, 'Q1', 14893, 6029, 1279, 8371, 326, 443, 564, 990, 15900),
 (1970, 'Q2', 14893, 4998, 1279, 6290, 326, 443, 564, 990, 15900),
 (1970, 'Q3', 14107, 4463, 1202, 7343, 180, 478, 543, 919, 15128),
 (1970, 'Q4', 14107, 5736, 1202, 8404, 180, 478, 543, 919, 15128),
 (1971, 'Q1', 14107, 6784, 1202, 10442, 180, 478, 543, 919, 15128),
 (1971, 'Q2', 14107, 6028, 1202, 9196, 180, 478, 543, 919, 15128),
 (1971, 'Q3', 16589, 5241, 1374, 8647, 294, 574, 824, 1033, 17987),
 (1971, 'Q4', 16589, 5712, 1374, 9173, 294, 574, 824, 1033, 17987),
 (1972, 'Q1', 16589, 6183, 1374, 8872, 294, 574, 824, 1033, 17987),
 (1972, 'Q2', 16589, 6138, 1374, 9018, 294, 574, 824, 1033, 17987),
 (1972, 'Q3', 15298, 4712, 1399, 8023, 190, 559, 744, 974, 16601),
 (1972, 'Q4', 15298, 4850, 1399, 7334, 190, 559, 744, 974, 16601),
 (1973, 'Q1', 15298, 5967, 1399, 8352, 190, 559, 744, 974, 16601),
 (1973, 'Q2', 15298, 5854, 1399, 8799, 190, 559, 744, 974, 16601),
 (1973, 'Q3', 15126, 4696, 1347, 7878, 208, 589, 741, 997, 16456),
 (1973, 'Q4', 15126, 5354, 1347, 7625, 208, 589, 741, 997, 16456),
 (1974, 'Q1', 14802, 5026, 1578, 7009, 168, 589, 835, 1021, 16226),
 (1974, 'Q2', 14802, 5999, 1578, 8270, 168, 589, 835, 1021, 16226),
 (1974, 'Q3', 14463, 4718, 1417, 7088, 238, 583, 754, 1002, 15800),
 (1974, 'Q4', 14463, 4864, 1417, 6455, 238, 583, 754, 1002, 15800),
 (1975, 'Q1', 14969, 5178, 1665, 6986, 156, 545, 799, 984, 16313),
 (1975, 'Q2', 14969, 5206, 1665, 6908, 156, 545, 799, 984, 16313),
 (1975, 'Q3', 13260, 4381, 1606, 6019, 317, 523, 799, 937, 14582),
 (1975, 'Q4', 13260, 4365, 1606, 6216, 317, 523, 799, 937, 14582),
 (1976, 'Q1', 13785, 4703, 1719, 6155, 193, 625, 764, 1015, 15174),
 (1976, 'Q2', 13785, 4770, 1719, 6074, 193, 625, 764, 1015, 15174),
 (1976, 'Q3', 13431, 4591, 1548, 6197, 183, 557, 620, 912, 14608),
 (1976, 'Q4', 13431, 4753, 1548, 6199, 183, 557, 620, 912, 14608),
 (1977, 'Q1', 13152, 4388, 1320, 6408, 147, 566, 668, 889, 14386),
 (1977, 'Q2', 13152, 4452, 1320, 6188, 147, 566, 668, 889, 14386),
 (1977, 'Q3', 11309, 3769, 1226, 5393, 144, 475, 570, 777, 12354),
 (1977, 'Q4', 11309, 3817, 1226, 5241, 144, 475, 570, 777, 12354),
 (1978, 'Q1', 13669, 4735, 1661, 6075, 177, 549, 754, 1021, 14972),
 (1978, 'Q2', 13669, 4830, 1661, 6139, 177, 549, 754, 1021, 14972),
 (1978, 'Q3', 12884, 4492, 1566, 5699, 230, 477, 644, 897, 14005),
 (1978, 'Q4', 12884, 4741, 1566, 5401, 230, 477, 644, 897, 14005),
 (1979, 'Q1', 13140, 4471, 1351, 6242, 214, 413, 483, 852, 14036),
 (1979, 'Q2', 13140, 5122, 1351, 7736, 214, 413, 483, 852, 14036),
 (1979, 'Q3', 13217, 4322, 1353, 6498, 208, 391, 459, 836, 14067),
 (1979, 'Q4', 13217, 4264, 1353, 6415, 208, 391, 459, 836, 14067),
 (1980, 'Q1', 26349, 9208, 2859, 12253, 283, 876, 811, 1746, 28036),
 (1980, 'Q2', 26349, 9282, 2859, 11610, 283, 876, 811, 1746, 28036),
 (1980, 'Q3', 24551, 8416, 2962, 11172, 324, 862, 871, 1677, 26284),
 (1980, 'Q4', 24551, 8887, 2962, 11439, 324, 862, 871, 1677, 26284),
 (1981, 'Q1', 29201, 10235, 3444, 12951, 391, 1069, 970, 2180, 31240),
 (1981, 'Q2', 29201, 11080, 3444, 13978, 391, 1069, 970, 2180, 31240),
 (1981, 'Q3', 29588, 11110, 3291, 12815, 376, 1010, 970, 1996, 31568),
 (1981, 'Q4', 29588, 10960, 3291, 12331, 376, 1010, 970, 1996, 31568),
 (1982, 'Q1', 25942, 9966, 3054, 10747, 301, 915, 919, 1874, 27776),
 (1982, 'Q2', 25942, 10525, 3054, 11375, 301, 915, 919, 1874, 27776),
 (1982, 'Q3', 24070, 9455, 2854, 9670, 327, 910, 924, 1764, 25904),
 (1982, 'Q4', 24070, 9128, 2854, 9072, 327, 910, 924, 1764, 25904),
 (1983, 'Q1', 21706, 8336, 2814, 8584, 248, 932, 871, 1724, 23509),
 (1983, 'Q2', 21706, 8473, 2814, 9071, 248, 932, 871, 1724, 23509),
 (1983, 'Q3', 20631, 7892, 2497, 8236, 261, 908, 842, 1745, 22381),
 (1983, 'Q4', 20631, 7892, 2497, 8032, 261, 908, 842, 1745, 22381),
 (1984, 'Q1', 17208, 6591, 1991, 6954, 191, 788, 647, 1481, 18643),
 (1984, 'Q2', 17208, 7193, 1991, 7991, 191, 788, 647, 1481, 18643),
 (1984, 'Q3', 17960, 6770, 2001, 7414, 223, 782, 644, 1552, 19386),
 (1984, 'Q4', 17960, 6662, 2001, 7045, 223, 782, 644, 1552, 19386),
 (1985, 'Q1', 14040, 5569, 1576, 5332, 173, 725, 553, 1390, 15318),
 (1985, 'Q2', 14040, 6063, 1576, 6056, 173, 725, 553, 1390, 15318),
 (1985, 'Q3', 13786, 5556, 1430, 5346, 178, 620, 466, 1276, 14872),
 (1985, 'Q4', 13786, 5080, 1430, 4829, 178, 620, 466, 1276, 14872),
 (1986, 'Q1', 10964, 4236, 1232, 4266, 152, 600, 382, 1078, 11946),
 (1986, 'Q2', 10815, 4230, 1160, 4262, 160, 606, 363, 1003, 11784),
 (1986, 'Q3', 10618, 4189, 1122, 4168, 160, 617, 384, 979, 11619),
 (1986, 'Q4', 9648, 3854, 1007, 3700, 156, 574, 398, 931, 10620),
 (1987, 'Q1', 9503, 3786, 1036, 3598, 140, 581, 366, 943, 10450),
 (1987, 'Q2', 9198, 3518, 1005, 3560, 155, 580, 383, 960, 10161),
 (1987, 'Q3', 8927, 3520, 961, 3411, 134, 546, 320, 901, 9793),
 (1987, 'Q4', 8361, 3396, 916, 3104, 107, 521, 293, 838, 9175),
 (1988, 'Q1', 7861, 3100, 905, 2888, 142, 496, 267, 826, 8624),
 (1988, 'Q2', 8861, 3539, 934, 3382, 121, 545, 278, 885, 9684),
 (1988, 'Q3', 8481, 3385, 861, 3269, 142, 511, 269, 824, 9261),
 (1988, 'Q4', 8162, 3253, 933, 3059, 118, 481, 255, 799, 8898),
 (1989, 'Q1', 8875, 3625, 1037, 3233, 158, 500, 263, 822, 9638),
 (1989, 'Q2', 9519, 3703, 1052, 3645, 234, 542, 287, 885, 10348),
 (1989, 'Q3', 10067, 3956, 1128, 3864, 202, 563, 290, 917, 10920),
 (1989, 'Q4', 10260, 4190, 1166, 3795, 175, 565, 307, 934, 11132),
 (1990, 'Q1', 10664, 4095, 1260, 4146, 168, 599, 326, 995, 11589),
 (1990, 'Q2', 10666, 3947, 1267, 4285, 187, 609, 329, 980, 11604),
 (1990, 'Q3', 11164, 4160, 1291, 4471, 205, 602, 334, 1037, 12100),
 (1990, 'Q4', 10709, 4088, 1293, 4153, 151, 601, 326, 1024, 11636),
 (1991, 'Q1', 10360, 3938, 1365, 3863, 152, 630, 320, 1042, 11310),
 (1991, 'Q2', 10826, 3954, 1455, 4135, 205, 676, 346, 1077, 11848),
 (1991, 'Q3', 10436, 3835, 1295, 4062, 221, 667, 341, 1023, 11444),
 (1991, 'Q4', 10802, 4016, 1427, 4093, 176, 677, 348, 1090, 11827),
 (1992, 'Q1', 10219, 3787, 1357, 3925, 108, 653, 365, 1042, 11237),
 (1992, 'Q2', 10902, 4099, 1404, 4148, 172, 676, 374, 1079, 11952),
 (1992, 'Q3', 11027, 4223, 1376, 4153, 204, 684, 396, 1071, 12107),
 (1992, 'Q4', 10744, 4271, 1410, 3816, 155, 686, 408, 1092, 11838),
 (1993, 'Q1', 10405, 4195, 1436, 3557, 159, 647, 385, 1058, 11437),
 (1993, 'Q2', 9284, 3618, 1244, 3249, 175, 623, 370, 998, 10277),
 (1993, 'Q3', 9417, 3603, 1258, 3295, 269, 636, 365, 992, 10418),
 (1993, 'Q4', 9386, 3669, 1224, 3261, 216, 616, 357, 1016, 10359),
 (1994, 'Q1', 9142, 3470, 1103, 3338, 195, 649, 364, 1036, 10155),
 (1994, 'Q2', 9338, 3470, 1025, 3608, 222, 640, 371, 1013, 10349),
 (1994, 'Q3', 9037, 3395, 986, 3506, 209, 601, 334, 941, 9972),
 (1994, 'Q4', 9320, 3423, 1036, 3687, 198, 616, 324, 976, 10260),
 (1995, 'Q1', 9784, 3687, 1077, 3680, 248, 690, 389, 1092, 10863),
 (1995, 'Q2', 9475, 3448, 1033, 3540, 402, 645, 376, 1052, 10496),
 (1995, 'Q3', 10034, 3811, 1091, 3668, 364, 670, 378, 1100, 11082),
 (1995, 'Q4', 10357, 3975, 1170, 3676, 389, 665, 394, 1147, 11416),
 (1996, 'Q1', 10209, 3792, 1163, 3769, 348, 690, 389, 1137, 11288),
 (1996, 'Q2', 11228, 4136, 1164, 4393, 364, 735, 417, 1171, 12380),
 (1996, 'Q3', 11279, 3992, 1243, 3969, 877, 711, 427, 1198, 12417),
 (1996, 'Q4', 11248, 4023, 1227, 4298, 433, 704, 386, 1267, 12338),
 (1997, 'Q1', 12541, 4611, 1344, 4800, 385, 804, 426, 1401, 13769),
 (1997, 'Q2', 12796, 3770, 1385, 4713, 564, 785, 440, 1364, 14021),
 (1997, 'Q3', 12703, 4783, 1459, 4691, 346, 780, 434, 1424, 13917),
 (1997, 'Q4', 14076, 5208, 1708, 5053, 450, 820, 432, 1657, 15328),
 (1998, 'Q1', 13364, 4856, 1667, 4760, 536, 843, 450, 1545, 14657),
 (1998, 'Q2', 14215, 5121, 1678, 5138, 604, 845, 433, 1674, 15493),
 (1998, 'Q3', 14095, 4632, 1686, 5436, 698, 835, 428, 1643, 15358),
 (1998, 'Q4', 14382, 5006, 1679, 5141, 906, 871, 408, 1650, 15661),
 (1999, 'Q1', 14728, 5151, 1760, 5687, 493, 912, 430, 1637, 16070),
 (1999, 'Q2', 16225, 5702, 1811, 6195, 733, 992, 448, 1784, 17665),
 (1999, 'Q3', 16041, 5421, 2007, 5831, 981, 988, 453, 1801, 17482),
 (1999, 'Q4', 15881, 5433, 2177, 6084, 406, 973, 441, 1781, 17295),
 (2000, 'Q1', 15740, 5244, 2027, 5855, 788, 944, 435, 1826, 17119),
 (2000, 'Q2', 15087, 4873, 1902, 5901, 712, 921, 430, 1699, 16438),
 (2000, 'Q3', 14990, 4879, 2047, 5582, 790, 987, 421, 1692, 16398),
 (2000, 'Q4', 15243, 4765, 1810, 6480, 347, 1027, 412, 1841, 16682),
 (2001, 'Q1', 14735, 4476, 1729, 6324, 323, 1051, 411, 1883, 16197),
 (2001, 'Q2', 13459, 4079, 1647, 5759, 316, 934, 393, 1658, 14786),
 (2001, 'Q3', 15504, 4698, 1826, 6758, 311, 1034, 404, 1911, 16942),
 (2001, 'Q4', 13774, 4239, 1451, 6039, 259, 1000, 374, 1786, 15148),
 (2002, 'Q1', 14178, 4357, 1675, 6008, 198, 1076, 392, 1940, 15646),
 (2002, 'Q2', 15782, 5176, 1976, 6384, 248, 1138, 452, 1998, 17372),
 (2002, 'Q3', 16186, 5437, 2274, 6310, 212, 1128, 438, 1953, 17752),
 (2002, 'Q4', 14460, 4608, 1681, 6149, 169, 1120, 394, 1853, 15974),
 (2003, 'Q1', 14319, 4683, 1606, 5910, 162, 1130, 394, 1958, 15843),
 (2003, 'Q2', 15302, 4825, 1805, 6377, 233, 1200, 460, 2062, 16962),
 (2003, 'Q3', 14497, 4456, 1699, 6262, 172, 1088, 418, 1908, 16003),
 (2003, 'Q4', 14489, 4504, 1716, 6146, 130, 1090, 437, 1993, 16016),
 (2004, 'Q1', 16933, 6046, 1849, 6640, 129, 1336, 497, 2269, 18766),
 (2004, 'Q2', 17736, 6123, 1848, 7231, 250, 1356, 510, 2284, 19602),
 (2004, 'Q3', 16351, 5651, 1752, 6724, 170, 1218, 483, 2054, 18052),
 (2004, 'Q4', 14298, 4954, 1584, 5882, 111, 1084, 449, 1767, 15829),
 (2005, 'Q1', 13837, 4676, 1667, 5618, 84, 954, 387, 1792, 15178),
 (2005, 'Q2', 12473, 3997, 1539, 5096, 116, 922, 381, 1725, 13776),
 (2005, 'Q3', 13674, 4294, 1516, 6010, 99, 1001, 469, 1755, 15145),
 (2005, 'Q4', 16114, 5226, 1692, 6923, 83, 1191, 539, 2190, 17844),
 (2006, 'Q1', 15595, 5078, 1629, 6694, 70, 1168, 543, 2124, 17306),
 (2006, 'Q2', 15372, 5196, 1466, 6532, 235, 1151, 556, 1943, 17079),
 (2006, 'Q3', 15341, 5049, 1546, 6565, 192, 1165, 585, 1989, 17091),
 (2006, 'Q4', 14127, 4535, 1351, 6276, 101, 1090, 511, 1864, 15728),
 (2007, 'Q1', 14062, 4710, 1549, 5809, 94, 1208, 577, 1900, 15847),
 (2007, 'Q2', 15203, 4950, 1532, 6390, 248, 1307, 670, 2083, 17180),
 (2007, 'Q3', 13441, 4490, 1498, 5416, 211, 1172, 566, 1826, 15179),
 (2007, 'Q4', 13134, 4316, 1397, 5469, 70, 1119, 541, 1882, 14794),
 (2008, 'Q1', 11951, 3934, 1097, 5260, 52, 1126, 546, 1608, 13623),
 (2008, 'Q2', 12320, 4117, 1247, 5236, 102, 1148, 519, 1618, 13987),
 (2008, 'Q3', 11154, 3730, 1302, 4526, 56, 1029, 445, 1540, 12628),
 (2008, 'Q4', 8811, 2951, 838, 3572, 32, 951, 398, 1418, 10160)]

In [42]:
##2.Save the list as a txt file

In [43]:
file = open('Ireland_Avg_Earnings_Week.txt', 'w')

for tuple in y:
    file.write(str(tuple) + ',' + '\n')

file.close()

In [44]:
#pip install pandas mysql-connector-python

In [45]:
import pandas as pd
import mysql.connector

In [46]:
## Connect to MYSql database

In [47]:
db = mysql.connector.connect(
host="localhost",
user="root",
password="ParklandsRow7*",
database="ireland_avg_earnings_week"
)

In [48]:
conn = db.cursor()

In [50]:
conn.execute("CREATE DATABASE ireland_avg_earnings_week;") ## Create a Database "ireland_avg_earnings_week"

In [ ]:
conn.execute ("USE ireland_avg_earnings_week") ## Use the "ireland_avg_earnings_week" database to create table and incert the data from above txt file.

In [ ]:
conn.execute("CREATE TABLE avg_earnings_week (Year int, Quarter VARCHAR(10), Manual_employee_grades int, Skilled_operatives int, Apprentices int, Semi_skilled_adults int, Clerical_employees_female int, Clerical_employees_male int, Foremen_and_supervisors int, Clerical_and_Operatives int);")
## Create table "avg_earnings_week"

In [ ]:
db.commit() ## Commit the code to MYsql

In [ ]:
##  After creating the Database and the table in Mysql go to txt file and Copy all the data and go to MySql and create a Insert INTO table values 
##  and paste all the data and run it.